{
  "Aatrox": {
    "champion_icon": "images/champs/Aatrox.png",
    "difficulty": "Even",
    "tips": "Runes: PTA/Conq, Goal in lane: Outfarm him until Hydra, you can kill him then 100%, before that it's difficult, especially if he rushes armor boots. Wave 1-4: Cheater recall, and try to get a freeze. Tips: Take Ignite Care for his empowered auto, wait for him to use it on a minion. Try to parry his Q when he has no E or predict where he uses E if he often does it in the same way, otherwise you can parry his W and look to dodge his Q's with your movespeed and your own Q. Getting executioner is very helpful in this matchup if you don't have ignite. Try to pull in the waves so you can look for an all in and run him down with conqueror stacked, try to poke him to make him use E or Q and then when his spells are on cooldown look for a big all in. (Some take bramble + grasp, very, very rare but in the off chance they do try to freeze and get the biggest lead you can in lane as they are trying to survive lane to teamfight later",
    "runes": "images/runes/page3.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png", "images/items/cdrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Akali": {
    "champion_icon": "images/champs/Akali.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Punish until level 6, after that SURVIVE until u get Hydra + Hexdrinker , you can 1v1 her afterwards. Wave 1-4: Cheater recall on wave 3, attempt to freeze on the bounceback, or call for a jungler gank. Tips: Abuse her early game before she gets a lot of points into Q, otherwise she will just run you down when level 7-9 (4 to 5 points in Q), especially with buffs her powerspike has become even MORE OP. Try to all in her in the early levels, parrying her passive auto is helpful but if she uses E always parry when she dashes back as its a guaranteed parry. Hexdrinker can help you survive her all ins level 6 as she basically runs you down once she has points in Q, this is the only way you can fight her back, try not to let her poke you down with shroud, run away and look for poke. You can Q her while she is invisible so look to do that. Note that red trinket helps when she uses shroud for your Q's.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Akshan": {
    "champion_icon": "images/champs/Akshan.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Poke him down, survive until items, and beat him once you get your powerspikes. Tips: This is a hard matchup, play similar to most range matchups, you only want to hit on front vitals, but in this particular matchup, his level 1 is very strong. Don't forget to play for bushes to not get poked down too much while farming. You want to run Dshield + Second wind, play safe until level 2 and wait for your parry to block his PTA or double auto/Q. Care for his poke and short trades, he can do a lot of dmg in a short amount of time, and hitting parry is very hard due to his mobility so wait until he is locked in an animation. Hide between turrets or minions to block his R, or you can parry it as well. He is very gankable so ask for jungle ganks! You hard out scale him, so play for that!",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Camille": {
    "champion_icon": "images/champs/Camille.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish her, get a lead, DO NOT DIE, she can snowball very well. Wave 1-4: Get a cheater recall, Camille has very bad waveclear. Tips: Spacing and kiting is really important in this MU! Constantly look for poke and parry her E when possible (they will try to bait it, but you can usually react), you can also use parry when she gets her AD shield (as parry does AP DMG) even better if you can block something at the same time. Her main threat is her poke, ignite and her gank follow-up with ultimate. Try to abuse her as much as possible in lane, look for poke, Q in her W, look to extend trades as much as possible as short trades benefit her. There is a little trick you can do when she uses E to run away, you can use QW to block it and stun her.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Cassiopeia": {
    "champion_icon": "images/champs/Cassiopeia.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Outplay her, punish her on freezes and deny her resources. Wave 1-4: Poke with Q, don't trade for too long, proc your PTA and back off, you can match prio, but you can't push that hard either. Tips: Dorans Shield + Second Wind. In this matchup you need to have good knowledge of Cassio cooldowns to dodge her Q. Early boots work wonders in this matchup as she cant buy boots as well so the movespeed diff is hiuge. Hit vitals and try to kite her out dodge her Q, if she uses miasma for slow to guarantee a Q in that case you have to parry it. This will give you time to get out of the miasma and dodge the upcoming Q, as long as she doesn't hit too many Q's she will lose too much hp and mana making it really easy to win. If she does manage to hit a Q, use bushes to remove vision and similarly to a lot of matchups, your jung will get free ganks if she wards bush. Thankfully due to the nature of her poison dot, Dshield + Second Wind is very effective as you can heal up hard. You want to pull in waves and stay near minion while dodging her Q so she pushes in while trying to poke. With a pulled in wave you can sort of run her down while dodging her abilities and kiting her, it requires practice as you have to balance dodging and damaging her at the same time with movespeed. Once you hit level 6 you need to either parry Q if you will take a lot of poke then move back to dodge her R, or you simply wait for her to R and parry it, you can run her down with ultimate , you completely outdamage and outheal her. If you don't have low ping, I'd recommend trying to juke her R by going behind her or predicting it. This matchup is very skill based and can go both ways. If you have good mechanics and mastery with Fiora you win it! GL HF",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Cho'Gath": {
    "champion_icon": "images/champs/ChoGath.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: STOMP HIM, CHOGATH IS EXTREMELY WEAK, REACT AND PARRY HIS W AND YOU WIN. Wave 1-4: Cheater recall, comeback and FORCE a freeze, if u need to TP to get back in time to freeze, DO IT. Tips: Really easy matchup you win most type of trades, he has very easy to parry abilities, though you need a good bit of tenacity to parry silence into knockup, you win them anyway. Pull in waves, look to freeze and run him down, he lacks so much mobility and is an HP Tank, basically a dream come true for Fiora. Just be wary of getting kited with his slow on spikes, he can kite vitals and be a menace if he gets a lead into bramble vest due to being too tanky.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/swifties.png", "images/items/cdrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Darius": {
    "champion_icon": "images/champs/Darius.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Beat him in the 1v1, get freezes and deny him resources. Wave 1-4: Poke with Q on front vitals when he tries to farm, you can't get prio in this matchup, wait to be level 3 and then you can start winning trades. Tips: There are two ways of playing this matchup Either you go D Shield + Second wind and you hard play for scaling and short trades (works really well with his passive as you constantly refresh it and have insane healing). One option in this lane is to go sorcery with celerity and nimbus cloak, you also take ignite and look to cheese him with an all in and run him down with ignite. Avoid parrying his Q due to it still healing him, if you can parry AA + W you basically insta won. Care when using Q as he can grab you mid Q to make it go on a long cooldown. Level 6 you can use parry on his ultimate to completely block his execute, though they can use E into R making it impossible to parry due to the CC. In early levels you want to look for poke and small trades with parry, parrying his W is insane and makes him lose so much damage and basically wins the trade for you. Call jungler for help as Darius has terrible mobility and options to survive a gank. If you respect him, you can outscale him and even kill him with the cheese build.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Dr. Mundo": {
    "champion_icon": "images/champs/Dr_Mundo.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Deny him as much resources as possible, while getting as much as possible, as killing him isn't very possible. Wave 1-4: Cheater recall > Freeze Tips: The new Mundo is more of a pain than the old Mundo. Poke him down on vitals front or back and dodge his Q's, in melee you can also parry his Q if you count the cooldowns properly, as they will use it as soon as they get it. You win all ins but you might lose if you play for too much short trades and get hit by too many Q's. Typically they will stay away and spam Q for cs, its hard to block them after the rework as it does too much damage now. Once he hits level 6 (ignite or executioner is a big plus) you can just run him down, if he has tabis he can just run away, but if he has bramble you will have a bit of a harder time, but still good as long as you dont get poked too much and parry his Q slow so he cant kite you out. Hard to stomp, but free scaling lane, it all depends on who can have more impact in the mid/late game. Don't let him have too much impact later on in teamfights, try to force him on side with splitpush and ping when he moves.",
    "runes": "images/runes/page3.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Ignite.png", "images/summs/Ghost.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png", "images/items/cdrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Gangplank": {
    "champion_icon": "images/champs/Gangplank.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Poke him down if grasp, and get a small lead. If conq and pta, you want to snowball, ask your jungler for help, and play to trade him especially when u have a freeze. Wave 1-4: Try to avoid getting prio, as often times u will have to get poked way too much to achieve prio. Play for trades, and conserve hp. Tips: Ignite is decent in this matchup. This is a difficult matchup, due to him not having any abilites that you can stun onto him, and even then he can just use his W to remove the cripple of your parry. Now with the rework, he is a bit easier as his poke is weaker than before so you have a way better chance at surviving than before and you can even retaliate and make him suffer in lane You want to go Dshield + Second wind, look for short trades with parry, either you parry a grasp Q, His passive proc (very nice as it guarantees that you hit it) Or his barrel explosion, but you can sometimes proc his barrels with an AA or AA E to make sure you destroy the barrel. If he has 1 hp barrels you can look for Q AA on the barrel as its hard for him to react and instantly pop the barrel unless he is close to it. Very advanced trick really difficult to execute but, if he places 2 barrels and explodes the 1st one so the 2nd one hits you, you can Q INBETWEEN BOTH OF THE BARRELS. In that way neither barrels will hit you as you went on the 1st one right as the explosion finished, and avoided the 2nd one as you Q'd out. Otherwise, wait till you get a freeze to all in him, if he gets sheen, just play it slow and poke him down with QW and try to AA E the barrels when he doesn't have his passive up. GP is very gankable though, so ask jungler for help as it's pretty easy to kill him in a gank. You want to pull in the waves and let him push, as the wave state is more favorable for your all ins.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Garen": {
    "champion_icon": "images/champs/Garen.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish him, this is a winning matchup for Fiora, just becareful when he has boots and 6. Wave 1-4: Cheater recall, and TP back to lane if he has ignite, so he cant crash it, keep that freeze as long as possible. Tips: Look for poke constantly to reset his passive, don't let him heal up. Parry his Q in the early game as you can react to the animation and it isn't cancelable. It's not the best idea to look for an all in when he has W, but you can bait it out and hold in the meantime then use your abilities when his W is over. If he has ignite, use tp to your advantage it's huge. Care when he has level 6, he can Q and then Ultimate so you can't parry it due to the silence. Otherwise you can react to his ultimate and get a free kill.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ghost.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Gnar": {
    "champion_icon": "images/champs/Gnar.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Deny him resources, get a small lead, kill him in mega form if he does a mistake, otherwise he isn't really killable. Wave 1-4: Get a cheater recall if you can, otherwise you can let him get push, just maximize your farm. Tips: Look for poke on front vitals, taking DShield + Second Wind is a must in this matchup. Parry his W pop, or his Q, if you can do both at the same time that's perfect. Really try to avoid skirmishing with him while he has mega as he has insanely low cooldowns and high base stats. You can parry his W but care as they often jump out. Here is a trick to parry Gnar R, wait until his mega is gonna disappear and he goes back to mini, in the last few seconds ENGAGE, and I guarantee he will use ultimate as he wants to use it anyways cause his ult is low cooldown and mega is gonna go away. Works like a charm. Otherwise just poke front vitals and try to chip him down while looking for an all in, if they ever jump in you hard win all ins. Although I said you shouldn't, often times bad Gnar players will overestimate themselves with mega so u can look for a kill as when in mini form they just play turbo safe.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ghost.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Gragas": {
    "champion_icon": "images/champs/Gragas.png",
    "difficulty": "Very Hard",
    "tips": "Runes: Grasp is best, but in elos below master, conq and pta also work well. Goal in lane: Scale and get 1-2 items then you can sorta beat him, killing him is impossible, he has AoE on every ability, infinite Sustain, has absurd CC. Wave 1-4: Stack your grasp, or if u don't have it, look for small trades and poke, u can contest prio, but can't really get a push going, he has too much AoE Tips: This is a skilled matchup, but slightly gragas favored, early game you win trades pretty hard, as long as you don't take too much poke and you manage your vitals you can win it, if you parry one E he pays a lot for it,. Look to poke him hard and look for semi all in, back vitals are fine as well as he can't E to run away so u can parry for slow. If you both use all spells in a trade you won that trade, problem is he typically runs away with phaserush, even without phaserush he can E you and slow with Q. You can Q and bait out his E to gain some distance and parry it, hard to explain but basically often times Gragas players will E as soon as you Q so you can move back with movespeed and parry it. The problem with this matchup is that once he gets 2nd recall he has a ton of cdr and basically pokes you down to death with small trades and Q spam. The good thing is as long as you don't int early, once you get hydra you win as his R is a free parry, parry either his E or R both make you have a free win, although if you parry E you get a good trade but not the kill as he can R you out. With proper tethering and kiting you win this MU. Pull in waves and look for all ins you win them as long as his cooldowns don't comeback up again.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Graves": {
    "champion_icon": "images/champs/Graves.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Stomp him in lane, beat him up, all in him with QW and repeat that until he is dead, I like to go ignite as it gives you more kill pressure, he has so much free armor thanks to his passive, so it helps. Wave 1-4: Look for small poke with Q, don't trade that much, you cannot contest prio versus graves, his push is too strong, wait for level 3 and you just start winning with QW engages. Tips: This is a unique, and quite rough matchup for Fiora if the Graves knows how to play, try to poke him a bit and parry his burst (Q or AA). It is very similar to classic range top champions, you want Dshield + Second Wind, and you also want to play around bushes to take less damage while farming up. He has too much wave clear for you to be able to contest him once he has 3 points in Q, they will usually just perma shove and maximize cs, when u get level 3 he is definitely killable if he oversteps, try to parry his auto as it will make it very hard for him to move. Once you get level 6 , it becomes very volatile as you both do a lot of DMG to each other, you can win an all in especially if you manage to proc all 4 vitals, usually not too easy considering his mobility. You want to typically call for jungle help or look to freeze waves in front of your turret, forcing him to walk up, and making him more vulnerable. You need to be very careful when dying in this MU as he can snowball extremely hard, the same goes for Fiora if she can get a lead it becomes very hard for Graves. Just try to go for trades where you can use all your abilities and repeat that until you can all in to kill him. You win on Hydra very easily.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Flash.png", "images/summs/Ignite.png", "images/summs/Teleport.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Gwen": {
    "champion_icon": "images/champs/Gwen.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish her as much as possible, deny her resources. Wave 1-4: Poke her down, don't extend trades too much, you don't have to give prio, you can sort of match it, but don't let her push too much. Tips: Take ignite. In this matchup you need to be VERY CAREFUL level 1, as she has can punish you very hard early especially with lethal tempo, but as long as you kite and don't fight her with too many auto attacks, you should win. Starting from level 2 and 3 you win short trades, look to poke on front vitals and possibly bait ou their Q. (If you try to hit a back vital, often times Gwen will E back during your Q to make you miss it and get some free poke, especially dangerous if she is level 6). In early you can look to parry her empowered Q, but you can also parry and E auto attack if your Q is coming up to dodge her Q, the as slow really makes her suffer. Try to parry her 3rd R when she gets level 6 it really denies her hard, especially if you can dodge the 2nd R with Q. Be patient and u win it, if she has ignite it is harder, but still favorable!",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Heimerdinger": {
    "champion_icon": "images/champs/Heimerdinger.png",
    "difficulty": "Very Hard",
    "tips": "Runes: PTA Goal in lane: SURVIVE, matchup is not playable in early game, you need to scale a bit, get 2-3 items. Wave 1-4: You can poke him a bit here, priotize his turrets as a simple Q + auto kills his turrets in early game, do not contest prio too much. Tips: This matchup is unplayable, you can only kill them level 1 if you all in and ignore turret damage, you can also Q + AA turrets destroying them in early. Even level 1 with turrets he completely melts you, although you can soak damage and destroy them, they have such low cost for him that it is possibly not even worth it. He has too much damage and poke that it makes it not survivable, even under turret he places his turrets on the limit of turret range and pokes you down so hard you cannot farm mages. Go Dshield + Second Wind to somehow survive. Even if you parry his E you don't guarantee a kill as he can dodge it so easily with turret movespeed and even then he can just DPS you to death, despite the stun. The main problem is that he can run away while damaging you, so you cannot get an easy vital proc as he just keeps kiting you. If he uses E poorly, you can look to all in while trying to parry his W and try to kill him, still very hard, but possibly manageable. Beg for jungler ganks and pray that you have a jungler that can gank Heimer otherwise just dodge it. DOOMED MATCHUP. Build hexdrinker for a bit of survivability.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Illaoi": {
    "champion_icon": "images/champs/Illaoi.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish her as much as possible, Fiora wins this matchup, but can lose after she gets frozen gauntlet if not ahead. Wave 1-4: Cheater > Freeze Tips: Take ignite. This matchup is basically a ping gap, if you have around 30 ping you can react to her E comfortably, but otherwise it's very hard. Use spells to dodge her abilites and tentacle smashes, but hold parry for E and kite her out when she uses Ultimate as she is unkillable. Ignite works well in this matchup due to her healing and the extra damage. Kiting is essential in this matchup, getting early boots is very helpful you stomp once you get Hydra.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Ignite.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Irelia": {
    "champion_icon": "images/champs/Irelia.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Punish as hard as you can. Wave 1-4: Push wave 3 and wait for wave to bounceback, impossible to cheater recall versus Irelia, she has too much waveclear. Tips: Take ignite. In this matchup it's all about who controls the lane, try to play super aggro early, and DO NOT PULL IN THIS MATCHUP! If she is able to start stacking her Q you are in a very dangerous position, her base damage is really high, although it is not as strong as before due to her changes, she is still a menace when fully stacked. Now even more than before, you can abuse her early, so try to take a lot of trades as long as she isn't fully stacked while starting the trade. Try to parry her E onto her if possible, level 6 you can parry her R as well. Hold your Q if she has minions she can dash on as she can dash on them making you miss your Q, very dangerous, so try to hold or do very short Q's. Don't use your burst on her W she won't take much DMG, especially later on, though proccing vitals is fine as it's true damage. Don't fight if she has a big minion wave, and respect her POWER SPIKES, just as she must respect yours.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Ignite.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Jax": {
    "champion_icon": "images/champs/Jax.png",
    "difficulty": "Even",
    "tips": "Runes: PTA, Goal in lane: To beat him in fights, get a freeze and deny him resources. Wave 1-4: Poke down with Q in front vitals, try to bait his E before Q'ing in, or do Q's that aren't reactable, he will most likely get prio, so win on level 3 and onwards. Tips: In the early laning with front vitals you can look to do short Q's, he cannot react to them and similarly to the riven matchup they might use E too early and whiff it without you needing to do anything, you just need to bluff the Q. Before level 6 you can look to parry his E if he always does it in the same way, although parrying his jump or W is really fine, often times holding parry for after his E is a really good tactic as well! Kite and poke him down if possible, then look to all in. When he is level 6 you can look to parry his jump for the as slow and bait his E to then you can respond by using Q out. Note that you can use tiamat to proc vitals despite his E, use this for movespeed and ultimate procs. If he gets early armor boots, play sort of passive until you get Hydra, you'll beat him then.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Jayce": {
    "champion_icon": "images/champs/Jayce.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA or Grasp Goal in lane: You can often look to get solokills in this matchup, as it is EXTREMELY volatile, ask for jungle help, Jayce is extremely gankable, punish him, and win the game. Wave 1-4: Look for poke, and try to match the wave push, if not possible just drop it and let him crash, otherwise play to not lose too much help, even if u need to drop some minions, as having enough health to trade is really important in this matchup. Tips: Hard matchup, only look for poke when you have a front vital, then reset the back vital and look for a front vital again. Dshield + Second wind is crucial in this matchup due to the sheer amount of overwhelming poke and options Jayce has, try to parry his empowered EQ in cannon form or his Lunge Q in hammer mode, as if you react quickly its a free parry, though if you are slow they can dodge it afterwards. If you can SOMEHOW parry his hammer E then you can hard abuse them, typically jayce players will either do it instantly or hold it so you can bait them out and use it when you start having a kill threat on them. Otherwise use bushes to your advantage to remove aggro and not let him poke you down, it helps for cs'ing minions, and if they ward the bushes you can call jungler for a gank.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Kalista": {
    "champion_icon": "images/champs/Kalista.png",
    "difficulty": "Very Hard",
    "tips": "Runes: Grasp or PTA, MAYBE Fleet is the best, really hard to say. Goal in lane: SURVIVE, until you get trinity, then u can sorta run her down. Wave 1-4: JUST STAND FAR AWAY, maybe last hit with Q, she is too strong in lane, can punish you super hard. Tips: Similar to most range matchups, where you want to play for bushes, maximize your cs and be as efficient as possible, obviously Dshield and second wind. You want to go for short trades with her while getting your QW off, if you manage to hit it and she is slow to react you can all in her and retreat towards bushes when needed. Kalista jump speed and lenght depends on her movespeed (boots upgrade) and her attack speed, but if you land your parry, she suffers as you reduce both of those lol. Ask your jungler for help, stridebreaker is pretty good in this MU, getting tabis helps a ton as well to negate her damage, if she goes hail of blades you can just QW into her and win every trade. She is super vulnerable to ganks and CC. Level 6 with whip or tabis you can all in her, she doesn't have much resistances so you can probably kill her if you land your QW but care if you miss and she has berserk boots you will die.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Karma": {
    "champion_icon": "images/champs/Karma.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Survive and get resources, punish her if she misplays and you are able to get a stun off, ask for jungle help. Wave 1-4: Look for small poke, but don't commit too hard as you will lose if the trades go on for too long. Tips: This is a hard matchup, play like usual ranged top champions, use bushes to your advantage, hit frontvitals etc.., Parry Mantra Q or W and if u can predict where she dodges when she uses W then you easily win it. Although a very hard matchup due to her poke, if you play it properly you can win it by outscaling and she has the desadvantage that if you manage to hit just 1 parry she gets hard punished for it. (You can QW to have an easier time hitting it, but it's risky as if u fail u get hard poked) Otherwise also call for jungler ganks as she is very gankable, ping when she roams (ward lane maybe.) She has more utility than u as her items are cheaper so she gets quicker powerspikes but if u manage to get your mythic or 2 items you can largely outpressure her on side. You win on Hydra here, using the E slow to get an easier chance at hitting the W when she roots you is a good strat as well.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Kayle": {
    "champion_icon": "images/champs/Kayle.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: PUNISH AS MUCH AS POSSIBLE, FREEZE, CALL FOR JUNGLER HELP, this matchup is hard after level 6, but unplayable for Kayle before level 6. Wave 1-4: Get Prio, Cheater recall > Freeze, and hold that freeze as long as you can. Tips: If you can punish her early, you hard win it, constantly deny her cs and poke her for each cs she wants to take. Parry his Q slow or PTA proc for damage, and you should be really fine. Play for cheesy plays as Kayle is really punishable, call jungler for help as you can really easily dive him. Once she gets level 6 with berserk boots it becomes significantly harder as she can kite you and out-maneuver you. Try to deny her the max amount of gold and exp and you are in a good spot. It's a race against the clock, punish her or lose. GL",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Kennen": {
    "champion_icon": "images/champs/Kennen.png",
    "difficulty": "Very Hard",
    "tips": "Runes: PTA Goal in lane: Get a cs lead, and possibly some plates, as getting a kill in this matchup, is impossible unless the kennen is boosted. Wave 1-4: You can look for prio, but essentially you don't want to lose too much health, poke him down a bit, don't lose too much health for cs. Tips: Similar lane to Jayce in terms of when you want to poke, only with front vitals, and use bushes to your advantage for aggro and to remove his poke. If you can successfully poke him down and parry one of his stuns you get a guaranteed flash or Kill in this matchup. When he uses ult you basically have a free parry but you just need land it, due to him having a lot of movespeed it's difficult but if you do he gets severely punished for it. Parry any of his abilities pre6 as long as they proc the stun, often times they will E into you for the stun, if you can parry it onto them they are DOOMED with no escape. So you can poke him down and look for a dive, with jungler as well, thankfully this lane is somewhat survivable so as long as you are patient and poke him down you can win it.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Kled": {
    "champion_icon": "images/champs/Kled.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish him as hard as possible on freezes, you win this matchup. Wave 1-4: Cheater recall then Freeze Tips: Easy matchup, any type of trades favors you really as long as you don't let him freely use his whole W. Try to parry his Q pull onto him, a lot of kleds like to E into you to dodge it so try to read the players habits (holding parry is also fine). Look to parry his ultimate to stop him from engaging in fights and going onto your team. If he is unmounted, parry cripple is really strong as he will really struggle to re-mount with the AS slow. Try to fight when the wave is pulled in so you can run him down.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "K'Sante": {
    "champion_icon": "images/champs/KSante.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Try to get more resources, or kill him and get plates Wave 1-4: Play for Q poke, you can also parry his normal Q's to deny him a TON of damage, and guarantee hitting the parry which is very valuable, you can get prio in this matchup. Tips: You wanna take DBlade Constantly be spacing (sideways) to anticipate and dodge his Q's, he can just spam them and poke you down, which is the main threat he has. I like to keep parry for his 3rd Q, and sometimes his W if he charges it up and its an obvious parry, although if he's in melee range and releases it early, it's extremely hard to react to, Try to keep in mind that he can kite you vitals pretty well with his abilities, (W & E), and bait out his abilities before going for risky vitals. As for his ultimate, try to be really mindful of where you are positioned as he can easily bring you towards his jungler and kill you.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/mrboots.png", "images/items/cdrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Lee Sin": {
    "champion_icon": "images/champs/Lee_Sin.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Get a freeze in lane, and punish him HARD, u win most trades, try to parry his E or Q depending on what he is maxing, u can see based on dmg. Wave 1-4: Look to get a cheater recall, but it can be hard as lee isn't the weakest champion earlygame with his E start. Tips: Play either aggro or really only for poke and short trades, depending on what runes/starters you took. I prefer going Dblade with bone plating and looking to all in him. Though you can also go Dshield + Secondwind due to his E spam in lane it helps counteract the dmg with the healing and you can survive the lane. You win all ins as long as you don't keep on fighting when his cooldowns are coming back. His sustain gives him too much of a huge lead, so you need to constantly look to be damaging him. Pre-6 look to parry his E or Q, both do a lot of dmg, the E will not let him slow you which helps a lot, and the Q will negate a lot of his damage. Often times lee sin players like to ward in lane to have the option to ward dash away, so if you notice this, think to yourself, my jungler has free ganks right? Yep, so just spam him to gank you when he is topside. If you can parry his R you are really in a good spot. (A little psychological trick to use on people who hold these crucial spells you can parry is, When you ultimate, as soon as you proc the 3rd vital, they will psychologically be like 'Oh I don't want him to pop ultimate fuck, I must use push away ability, aka Syndra E Jayce E Lee R etc...') So you can comfortably abuse this trick against unaware players",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/mrboots.png", "images/items/cdrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Lillia": {
    "champion_icon": "images/champs/Lillia.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish at any point in the lane, preferrably when freezing. Wave 1-4: Punish her on front vitals, it's unplayable for her. Tips: You can go Dblade, but Dshield + Second wind makes you heal sooo much in this MU. Really easy to handle, she lacks too much DMG to counteract your healing and damage, as long as you stay inside her during her Q and parry her W she can't really do much DMG. As long as you don't hard misplay it, you should win this matchup easily, her R is very parryable as well. In lane, try to just poke on vitals, wear her down while she tries to get damage on you while you heal it all up with dshield and second wind while she expends her whole mana pool. Care for level 1 trades as she can do a lot of DMG and kite you out, try not to chase for too long as she can deny you a lot of damage and dodge your parry quite easily. Very gankable, and very easy to handle, should be a free MU.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Lucian": {
    "champion_icon": "images/champs/Lucian.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA or Grasp Goal in lane: Play for resources, you can also solo kill him with a good QW if he gets careless, ask for jungler ganks. Wave 1-4: Look for poke, but not too much, u can hit front vitals but nothing more than that, it's important that you wait for level 3 to hard win trades as long as you land parry. Tips: This is a classic ranged matchup, you can win this matchup if you play it properly, take DShield + Second wind and look for poke on front vitals while then moving towards bushes to remove aggro. Use QW when his E is down, usually they will back off though, if you have a front vital you can surprise them with a QW even if they have E, only works in lower elos though. Rushing tabis makes the game so much harder for Lucian as he can't run as easily and deals way less damage. Resetting vitals is very important in this matchup. You win on Hydra.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Lulu": {
    "champion_icon": "images/champs/Lulu.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Survive, get more resources and plates, ask for jungler help, you can solo kill especially with PTA if they are bad. Wave 1-4: Look for quick poke, nothing too much, Lulu level 1 is suprisingly storng. Tips: This is basically an unplayable matchup. You can win all-ins level 3+ but she can just poke you to death and polymorph you, you can parry it but then she just uses E and Q. She has too many options, movespeed, poke, cc etc... Even with right runes and Items she melts you down. She also then has more utility than you in Teamfights, so it's a terrible matchup, although you can parry her Ult and kill her, and if she oversteps you can kill her. Call for ganks and pray that you get help, if you can get a lead it becomes wayy easier to stomp her.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Malphite": {
    "champion_icon": "images/champs/Malphite.png",
    "difficulty": "Hard",
    "tips": "Runes: Conq Goal in lane: Either play for resources, or gamble for kills, a lot of Malphites pick it as a counter pick, but do not know how to play versus Fiora, so you can PUNISH THEM. Wave 1-4: Play aggressively, parry his W auto, or his E slam, usually they are really predictable abilities Tips: The classic Fiora counter, or so people think. One benefit of this matchup, is that most people who pick Malphite into Fiora have no idea how to play the matchup so they will do a lot of mistakes due to them thinking 'Oh Malphite = free matchup I can do what I want'. You want to look to abuse him as MUCH as possible before he gets bramble vest + tabi's, if you can't gain a lead before he does that you will suffer terribly. Pre6 use Q to dodge comet from his Q, constantly look to poke and kill him, you can QW into a front vital if he uses Q as u counteract the slow and slow him. Otherwise, when engaging try to predict his E smash as it will cripple you, so parry it, and you will do so much more damage onto him in the early levels, try to freeze, deny him cs and make the biggest gap in the early that you possibly can, if they aren't that good you can guarantee a kill. After 6 + bramble you can still win , you really need to parry his E, but if SOMEHOW you parry his ultimate he is doomed, often times they will never ult from far away as it is easy to react to, although in melee range it's impossible. Having an AP jungler helps a lot as he can't stack as much armor, you can also look to dive him early if you have a Taliyah, Elise etc... and just completely abuse him for picking Malphite. Care when he hits 6 as the jungle will constantly look to be top for dives or engages.",
    "runes": "images/runes/page2.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Maokai": {
    "champion_icon": "images/champs/Maokai.png",
    "difficulty": "Very Easy",
    "tips": "Runes: PTA Goal in lane: Freeze and beat him up. Wave 1-4: Cheater > Freeze Tips: Rare matchup but really easy, you win any form of trade as long as he doesn't get his empowered E with bush on you. Both his Q & W are reactable and parryable very easily, same for his ultimate. Abuse him in lane, look to freeze and deny him xp and cs as he cannot commit as you win if you fight while the wave is pulled in towards you as you can chase him down.",
    "runes": "images/runes/page2.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Mordekaiser": {
    "champion_icon": "images/champs/Mordekaiser.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Freeze and punish him, as you win most all ins as long as you poke him down a bit before hand (60-80% hp is all in window) Wave 1-4: Cheater > Freeze. Tips: This matchup isn't difficult as long as you respect him, be wary of long trades especially once he gets bramble vest and a conqueror stacked, he can kite you out and tank so much while having insane healing and DPS. You can parry his Q or E, typically parrying his E is better for the stun, although it is harder to hit as they can move while using E, often parrying Q, and dodging E with Q is a better option. Once he hits level 6 you want to parry his ultimate if possible (it requires you to have lower ping, but if you do, it is very reactable). As long as you don't trade carelessly, and you win early, you should win this matchup.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Nasus": {
    "champion_icon": "images/champs/Nasus.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Punish him as much as possible, freeze and deny him as MUCH AS POSSIBLE, he beats you after sheen and armor boots if u haven't punished him Wave 1-4: Cheater into a freeze, KEEP THAT FREEZE AS LONG AS POSSIBLE, CALL YOUR JUNGLER TO COME. Tips: Just poke or all in, you win everything in early trades, if you parry his W he will either need to burn flash, get him out of lane or you kill him. You want to freeze and pull waves in to be able to run him down with parry and deny him cs/stacks. Once he hits level 6 you need to be a bit careful especially if he has sheen/bramble he is very strong. As long as you deny him stacks you won't lose this MU.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Neeko": {
    "champion_icon": "images/champs/Neeko.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: SURVIVE and get more farm and plates, matchup is tough, she has way too much range to be able to catch her, so unless you hit a wild parry or jungler helps, you won't be killing her. Wave 1-4: Look for small poke, don't commit too hard onto her, let her push in. Tips: In this matchup take Dshield + Second wind, double tenacity is also nice especially if their team has a lot of CC. It's a very rough matchup as she has so much range and movespeed, so try to play for bushes to hit front vitals, react to her E and parry it (QW works like wonders here). Thankfully her 6 is pretty bad vs Fiora, basically a free parry, and if u don't have parry you can usually Q out of it. So try to survive and call for ganks as she has little options to survive ganks, u can QW into front vitals if u want to go for a short skirmish. Thankfully you only need to succeed 1 parry for her to get really punished, so look for that in this matchup. You win on Hydra.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png", "images/items/mrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Nocturne": {
    "champion_icon": "images/champs/Nocturne.png",
    "difficulty": "Even",
    "tips": "Runes: PTA or Conq Goal in lane: Stomp him, this is a winning matchup, just wait for level 3, and after a few recalls this matchup becomes pretty good for Fiora. Wave 1-4: Don't fight him in all ins, especially if he has lethal tempo, he beats you level 1, you mainly wanna go for poke, and u can start beating him on level 3, let him get prio, as you can't contest it easily. Tips: Try to dodge his poke and hit Q's, level 3 you can look for engages if he tries to shield your W, you can either E to pop the shield if they use it early and then W, or you can QW hoping they fail and miss-time it, although if you fail the QW it is really dangerous.(In High Elo I recommend just tanking the fear, unless you see them actively using it early, they typically can react better, just use parry on his next Q or an AA, a trick I like doing is moving into the bush to use parry as they won't be able to react and block it.). You really want to fight once you get level 6, and well his ultimate isn't the best for 1v1 so abuse that and wards in lane are helpful for his roams to keep info. Care not to let him sustain 24/7 with minions, (thankfully it got nerfed), and respect the ignite and ask for jungler help if they do have ignite as it's free ganks.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Olaf": {
    "champion_icon": "images/champs/Olaf.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Win lane, this lane is a fight to the death, you need to be able to beat him in that fight, take ignite. Wave 1-4: Play for Q poke, but be very mindful of his all ins with Q level 1, if u get hit, go near your minion wave, as you should win fights with ur minion wave and ignite level 1. Tips: This matchup is favorable for Fiora, although you need to play it in a specific way. Olaf is somewhat similar to Darius in the way that he can chase you down really hard so you need to becareful when trading him. Olaf has pretty short range so you can abuse front vitals and go for Q poke, you should constantly look to reset back vitals. You want to poke him down until he is low enough to where you can win an all in. Ignite is very helpful in this matchup, try to kite him out don't go for auto attack fights, Q vitals kite around and go for the next vital. After level 6, you wanna go with the same plan, but you don't need to poke as much as your R damage + healing is enough to compensate for his strong dueling. BUT NEVER FIGHT HIM STRAIGHT UP, olaf is scary in a fist fight.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Flash.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Ornn": {
    "champion_icon": "images/champs/Ornn.png",
    "difficulty": "Easy",
    "tips": "Runes: Conq Goal in lane: Deny him as many resources as you can, and force plates when possible, as he has low damage. Wave 1-4: Cheater recall > Freeze. Tips: Pretty easy matchup, look to again pull in waves and play for all ins, he can win if you only play for poke as he shines in short trades. There are 3 things you can parry Pre-6, his E knockup, his W auto (although it is cancelable so care), or his Q pillar, if you go where the pillar will erupt, you can parry as the displace counts as a CC so you can parry it onto him. (will do a ytb video showcasing it). After level 6 you need to try and parry his ultimate as it renders him basically useless. Set up the waves so you can chase him down in trades and look for all ins and you win this GG.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Pantheon": {
    "champion_icon": "images/champs/Pantheon.png",
    "difficulty": "Hard",
    "tips": "Recommend: PTA Tips: Aha The old classic Fiora counter, even worse now that his Q has gotten buffed, Take Second wind for his Q poke. Look to poke him down and bait out his Q's, often times they will use Q on minions so you want to Q him when he doesnt have empowered Q. If possible parry his W (reactable from far away but not form close, so you need to predict). You can run him down going for extended trades is nice, as long as he cant get his W or another empowered Q off on you. Once you get Hydra the matchup is way easier as you can run him down, especially with level 6 as his ultimate is useless in lane. Often times when you Q they like to insta W so try and see if they have this habit so you can parry and hard punish them. Don't int early as you will win on 6 with pulled in waves.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Poppy": {
    "champion_icon": "images/champs/Poppy.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Punish her as much as possible as you win early, but lose hard after a few recalls. Wave 1-4: Look to get a lead in the early levels as she will beat you up later. Tips: Rough matchup, poke her down with Q's, try to bait her Q out before looking for Q's or do very short Q's and look to dodge her Q afterwards. Obviously avoid going near walls unless you want to bait her E, hard to react to but very possible. (Depends on how far away she is) Now comes the mindgame in this matchup, if she uses W before you engage just QW into her and stun her for free, care as they might try to dodge so shoot it accordingly. If they try to react to you Q and press W mid Q, you have to either go for very short not reactable Q's or QW with a predict and then get a juicy stun. If they hold their W then u need to care as they will bait you out. Typically Poppy mains will bounce between these 3 things and try to juke you out, so its all about who can get the upperhand in the mind game. Once she gets points into Q and bramble vest her base damage and tankyness is too high, with tabis she has so much movespeed you can't really all in her with R so try and play for scaling. An ap jungler helps a ton vs these high tankyness high base damage bramble vest abuser champs. You can also parry her R by reaction which is beneficial but overall this matchup is pretty bad, I'd try to avoid it.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/mrboots.png", "images/items/cdrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Qiyana": {
    "champion_icon": "images/champs/Qiyana.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Poke her down, deny her resources, IF POSSIBLE a solokill, but usually pretty hard. Wave 1-4: Get a cheater recall, you have complete prio in the early levels. Tip This is a very particular matchup, whether it be in mid or toplane, a bit easier in toplane as you can run her down for longer. In this matchup you win any sort of long trade or all in, but they will look to poke you down, so going Dshield + Secondwind helps more than you think. Any good Qiyana will consistently take the grass form, making you unable to hit her while she gets free damage off, so avoid trading for too long, red trinket helps a ton! Parry her Q, EQ or whatever might proc electrocute, and you should end up winning. Her R is really hard to parry, usually you need to predict as parrying it is almost impossible based on reaction alone. Getting lifesteal to survive or armor boots helps a lot in this sort of matchup. If you are midlane, going ignite versus less skilled players can be an optimal strategy as if they do 1 miss step they lose.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Quinn": {
    "champion_icon": "images/champs/Quinn.png",
    "difficulty": "Very Hard",
    "tips": "Runes: PTA or Grasp Goal in lane: Survive, and have more resources if possible, I recommend grasp but in lower elos PTA could be better. Once you get trinity you win fights, otherwise you basically have to poke her and trade hp for farm. Wave 1-4: Drop prio, look for poke on front vitals, you can't do much at this state of the game. Tips: Similar to Jayce & Kennen, poke with front vitals, look to move into bushes to remove vision (though she has W it has a very high cooldown), as long as you keep trading with front vitals you can most likely stay equal in terms of hp. In this matchup though instead of only poking with Q you can go for a Q AA E and maybe a parry or you hold it to block the double AA as her E is very hard to predict/react to especially in melee range. You can also look to parry electrocute or PTA proc. If you somehow parry E look to all in her, she is basically doomed, often times they take ignite so looking to recall for a cloth armor and refillable, or just to buy some items is very nice. PRAY FOR JUNGLE GANKS, you have really good follow up with QW.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Renekton": {
    "champion_icon": "images/champs/Renekton.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Go even and outscale him, do NOT GO BEHIND ELSE HE CAN SPAM DIVE YOU. Wave 1-4: Use your early advantage to get prio, you need to beat him as much as possible in the early game, he beats u when he gets level 6, so then u will need to wait until you get 2 items. Tips: This matchup requires good itemization and runes, especially considering how buffed he is atm. Going bone plating is amazing here Once he gets level 6 with bramble vest/steelcaps he becomes a big menace due to his sheer overwhelming stat diff, it literally becomes a Statcheck. You just need to scale and wait for Hydra or 2 items and you destroy him Contrarily to many misconceptions, you can completely dominate a Renekton in early game leading to a huge lead later on, just don't underestimate his powerspikes. Look to parry his Q or W if you can especially if empowered. Leashing is very bad as he gets free fury.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Rengar": {
    "champion_icon": "images/champs/Rengar.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Sort of survive, get your 1st and 2nd item, then you can beat him, before that his healing is too strong, Trinity rush is not bad here. Wave 1-4: Don't contest prio too hard, Rengar has a strong early, if he gives it up sure, otherwise just back off. Tips: This matchup changes depending on the Rengar's runes. If he has grasp and ignite, you want to play for scaling as he is too powerful in lane, give up cs wait for whip and level 6 and u can all in him. Look to parry his EMP Q or E for the stun. Care when he is near bushes with stacked fury as he can get a lot of dmg off. Tabis are amazing in this MU after your first item. You want to play the lane pretty passively, just poke and farm, he has WAY too much sustain now.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Riven": {
    "champion_icon": "images/champs/Riven.png",
    "difficulty": "Even",
    "tips": "Runes: PTA or Conq Goal in lane: Punish her as much as possible, you should be able to win this matchup if you play it properly. Wave 1-4: Poke her down with Q for every cs she tries to get. If you can eventually get a cheater recall it's nice, but try to get a freeze eventually. Tips: Take exhaust and flash. This matchup is all about powerspikes. Fight whenever you get items. What is important to realize is that in this matchup, the one who engages hard will lose 100%. As you need the mobility spells used to engage to kite out and hit vitals, same for riven, she needs to kite your vitals with Q and E. Look for poke to frustrate her, Q on front vitals and they will want to engage. You can look to engage if they use spells on the wave or you have conq stacked or if they are a bit lower on hp or overextended. You want to back off while doing long trades when her cooldowns will come back, as she can be very scary with full stacked Conq followed by a full combo. It's hard to react and use E as Riven to a short Q, often times they will fail their E. Care for her roaming and level 6 powerspike, she can 100-0 you if you arent cautious and use your powerspike carelessly. Try to parry her Q3 but often times they will look to W into Q3 but with double tenacity you can parry despite the W stun if they try to get an auto off. With all this you should be able to win the matchup as long as you respect her and stay disciplined. Take exhaust to make the matchup easier, especially if they have ignite. ",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Rumble": {
    "champion_icon": "images/champs/Rumble.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Need to punish him early as much as possible! Wave 1-4: PLAY SAFE, he can do 200 damage which is more than 25% of your health, level 1 with just 1 Q. Tips: DShield + Secondwind. Poke him down and do small all ins where you basically use your spells and bail, repeat when you have parry, avoid getting poked too hard by his E by staying behind minions and care for his Q poke. Good thing is his kit forces him to push so you get free ganks from your jungler if he has above room temperature IQ. You can also use bushes to not let him get free E's as well as poke with Q as he has to be more careful. Typically a rough matchup if the Rumble is good, Dblade is also a good option vs him if you want to play more aggressively as he lacks a lot of tankyness. With level 6 and hexdrinker, you can sort of all in, but it's hard. Early boots are always helpful here as he can kite your vitals with his movespeed due to W and E slow.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Ryze": {
    "champion_icon": "images/champs/Ryze.png",
    "difficulty": "Very Hard",
    "tips": "Runes: PTA or Grasp Goal in lane: Survive lane, try to get more farm and plates, although it is difficult, it's not possible, you can also kill him with a good prediction, ask for jungler help as Ryze is easy to gank. Wave 1-4: You can play pretty aggressive at this level, as he can't really punish you too hard, unless u chase too much, just proc Grasp or PTA and back off. Tips: Go Dshield + Second wind This is one of Fiora's worst matchups, you have to look to kill him and punish him before his first recall, if he gets recall with boots + mana he is unkillable due to phase rush and permanently pokes you down. You want to play it safe maybe even get vamp scepter with merc boots just to survive, PRAY your jungler gives you attention as in this matchup he can kill you even under turret due to the sheer amount of poke and range he has, with an infinite mana pool. Level 6 if he uses phase rush and engages you, you can look to all in him with R and look for a kill possibly, but often times they go Tabis. I would either see if my jungler can do early ganks, or dodge the game, as the matchup is unplayable though thankfully he is very gankable. You can win once you get Hydra & Mercs.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Sejuani": {
    "champion_icon": "images/champs/Sejuani.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Survive and get more resources, care for her damage once she starts getting more points in W. Wave 1-4: Look for Q poke, stack your grasp, or get your PTA procs off, you can't beat her too hard before level 3, so try to match her push, no need to play overly aggressive as she has really good gank follow up. Tips: This matchup is not an easy one, if both players are good, it can arguably be Seju Favored. She has way too much poke, and the ability to do damage while moving with her spells. Meaning she can really easily kite your vitals, go for poke on front vitals, with the sustain from your passive + grasp and dshield, you can beat her if u dont take too much free poke. Once you get Hydra it becomes way easier, so play until that powerspike. She has INSANE burst potential level 6 with ignite, be careful.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Sett": {
    "champion_icon": "images/champs/Sett.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Poke him down, until you can all in and kill him. (50-70% hp) Wave 1-4: Poke with Q, do not do extended trades, he will win until you get level 3, let him get prio if he really tries to contest it, his W is too strong early. Tips: This is not an easy matchup, though definitely winnable. You want to look to kite him down and tether him, look for poke and all in when he doesnt have cooldowns, if you can parry his E or W you win it. Often times Sett players will use E followed into W so you can't parry it, but if you take double tenacity in runes you can parry it as you will be out of the stun just in time to parry it (you need 25% tenacity for Sett EW to not work). Stack conq with Q's to loook for an all in. Care when he gets bramble vest as he already has insane base dmg so with the tankyness from bramble he becomes really unkillable. In that case you wait till you Hydra and just play the same game as before, looking for poke into all in. Parrying his ult is also insane but you need to parry behind you if you want him to be stunned as he will still go through you. Look to poke and pull in waves while removing minion aggro by moving in bushes, you can also play for bushes to deny him auto attacks or get an extra auto attack during trades. Tabis are a good buy in this matchup after 1st item.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Shaco": {
    "champion_icon": "images/champs/Shaco.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Deny him as many resources as possible, killing shaco isn't that doable as he has too many means to stall and escape. Wave 1-4: Get a cheater recall into a freeze, you have complete prio early. Tips: Get red trinket and control wards. Shaco is an interesting matchup, first and foremost take control wards and a red trinket to use in lane against his boxes. You can already parry his E or his QW into boxes to parry the fear and land a stun if he doesnt Q out. Going Dshield + second wind against his E and box poke helps SO MUCH. When he has his ultimate, care when you all in as he can get a TON OF DPS off, especially with backstabs and fears, going tabis if he is AD is a big help. YOU CAN EASILY identify the clone by seeing which one has the same vital as before, as the clone needs time for his vital to appear Overall an easy matchup you want to freeze and deny him the most cs possible, really hard to get a kill off as he has too many tools to run away, just don't fall into his traps and respect him and you are chilling.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Shen": {
    "champion_icon": "images/champs/Shen.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish him, bully him, beat him up, get more resources, he should not win this matchup. Wave 1-4: Get a cheater recall into a freeze, Shen has one of the worst waveclears in the entire game. Tips: Taking demolish in this matchup is very helpful for early plates, especially when they take IGN as if they roam/use R you basically are guaranteed 1 plate if not more. Try to poke him down with Q's especially when his Q is on cooldown, also when he has no shield is nice as well. With front vitals you can bait him to use Q by faking that you will Q the front vital but holding it and waiting for later until he no longer has Q/Shield from passive. React to his E when used from far away, often times they will walk behind you and E towards turret, so look for these habits and punish him. by parrying where he will dash. The downside is if you fail you will get punished horribly. Don't forget to sometimes parry behind you when he E's as he can go through you. When he uses W you typically want to run but you can still proc vitals for True Damage and Healing, although the auto wont do damage. (W also works when he W's duh). You can win this matchup pre-bramble, but after he gets it, it becomes very hard as he can just play for short trades and never commit so you will never have the option to look to proc ultimate. Care if his Spirit Blade is behind you as it'll make it 10x harder to survive. When he gets level 6 you want to spam ping your team. The problem here is against Shen you would rather freeze and look for all ins. But due to his ultimate he would rather you freeze than you get plates when he is away. So what I would recommend is freezing when his R is on cooldown and building up a slowpush when his R is up as you can crash it and take tons of plates if he uses ultimate. Sometimes they take ignite so punish with jungler or just recall and TP. if they use R take hella plates. Care when skirmishing, you want to back off a bit before his Q will come back as he will win if you trade in his cooldown windows.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Shyvana": {
    "champion_icon": "images/champs/Shyvana.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Freeze and deny her as much resources as possible, to be more useful in the mid/lategame Wave 1-4: Cheater > Freeze Tips: Easy matchup for Fiora. If she has Dark harvest go D Shield because she will look to poke you a lot. If she has Conq, PTA or something similar, take D Blade and just outrade her straight up. This is a pretty straight forward matchup where u want to look to poke her down bit by bit with small trades, second wind is obviously really nice to have due to her E poke without mana, otherwise, you can just parry her Q if she is AD, or E if she is AP, both lead to winning trades, she isn't much of a threat if played properly. You can just run her down easily, level 6 you win any sort of all in, you just need to care for her short trades and don't let her get small trades in. (If she has PTA parry the PTA proc and she has no damage). Look to keep the wave pulled in so you can run her down, freezing is usually best here, getting a cheater early on can help a lot as she doesn't have the best waveclear in early game.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png", "images/items/dd.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Singed": {
    "champion_icon": "images/champs/Singed.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: DO NOT LET HIM PROXY WHEN POSSIBLE, only way for him to win, is to proxy, if he does, kill him as much as possible without losing CS, not losing CS IS WAY MORE IMPORTANT. Wave 1-4: Push wave 3 to get a bounceback, DO NOT RECALL, else he will try to force a proxy after, just wait the bounceback, ward for jungle, and beat him in trades. Tips: Pretty easy matchup, early boots are really good here to not get kited too much. With d shield and second wind you have an insane amount of sustain (you can walk into his poison for 1 tick to proc the healing and refresh dshield + second wind it's really free healing). You can parry his E as it is usual pretty obvious, if they hold on for too long they lose anyway, if you manage to parry his E onto him just once, he will get hard punished so look for that. As long as you don't chase you win it.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png", "images/items/dd.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Sion": {
    "champion_icon": "images/champs/Sion.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish him as much as possible, deny resources, get plates. Wave 1-4: Be careful not to take too much poke as you might not be able to crash the wave, push as much as is safe, you want to eventually get a freeze versus Sion. Tips: You want to all in with pulled in waves, look to parry his Q if possible as he will get severly punished. Q out of his Q or use Parry to not get damaged too much in lane. Usually parrying towards the ends is better as they often hold, and even if they let go early, you kept your parry and it did less dmg, but if you parry and they hold you are DOOMED. Care when he buys bramble as he can sort of kite you. When looking to trade him, back off when his cooldowns are coming back off. As long as you are disciplined and respect this should be a win.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Sylas": {
    "champion_icon": "images/champs/Sylas.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish as much as possible. Wave 1-4: Cheater > Freeze. Tips: This is a slightly favored MU for Fiora, in this matchup you want to trade in a particular way. Look for poke and only commit if he retaliates. You can parry a lot of stuff in this MU, if you parry his E2 you can land a free stun and basically win the trade. You can also parry his W, denying him the healing, making him completely lose the trade. As long as you don't trade until his cooldowns comeback, you will win this MU without a problem. If level 6 is a problem, you can react to his R from afar and parry it, making him unable to steal your ult. You completely destroy him on Hydra, he doesn't stand a chance. If you really need to, ignite can help a lot, especially if you are midlane.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Tahm Kench": {
    "champion_icon": "images/champs/TahmKench.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Deny him as much resources as possible, as he is really hard to kill. Wave 1-4: Try to get prio and get a cheater recall off, but it can be tough as tahm kench isn't weak in the early levels, if not wait for level 3 and trade him, stop trading when parry is on cd. Tips: You want to poke him out don't look to go for all ins in the early levels as he is very strong, try to poke him down while trading in minions to not get hit by Q, you completely outrange and have way more mobility than he does. There are a ton of spells you can parry from his kit, his Q if he has 3 stacks, his devour if you can predict, and the easiest well, his old ultimate that is now his W so the abyssal dive, upon reappearing he knocks up everyone, so you get a free stun if he uses it on you.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png", "images/items/dd.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Teemo": {
    "champion_icon": "images/champs/Teemo.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Get more resources and farm, in lower elo you can often solo kill Teemo's by parrying a blind, but they won't blind you as much in high elo. Wave 1-4: Play a bit safe, last hit minions when you can, don't trade too much hp, wait for your level 3 to start getting significant trades off on him. Tips: This is a hard matchup You need to take the sustain build (Dshield + Second Wind). Only look for trades when u have W up, if you manage to parry his Q then you absolutely win it. Don't forget to buy red trinket + control wards for his shrooms. Unless he has tabis with grasp + ignite you can run him down level 6. Note you can QW into shrooms if one is inbetween you and Teemo as you won't get affected by it and will block the shroom simultaenously. Mercs after Hydra helps a lot in this matchup Teemo is also another champ who is very gankable.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png", "images/items/dd.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Trundle": {
    "champion_icon": "images/champs/Trundle.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Punish with short trades, and all in once he is in a kill window (60-80% hp) Wave 1-4: It's hard to get prio in this matchup, if you can try to get a cheater recall, otherwise just let him push in and go for short trades. Tips: Take ignite. Not that difficult of matchup as long as you play it RIGHT! Parry his Q and only play for short trades, you can techincally parry his pillar and stun him, but its so hard and basically impossible to consistently do. Trade everytime you get your parry, they usually insta Q or, Auto into Q. Get anti healing, once he has 6 try to poke him down and kill him in an all in.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png", "images/summs/Ghost.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Tryndamere": {
    "champion_icon": "images/champs/Tryndamere.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Freeze and punish him with short trades. Wave 1-4: Cheater recall > Freeze Tips: In this matchup, discipline is really important, you need to be patient! As long as you play for poke and don't all in without parry you are fine, you can sort of kite him if he engages you with your move speed, if he dares to E in your minion wave to fight you, you will destroy him, just care not to fight when he has the wave pulled in as that is how he wants to fight to run you down with ghost. In this matchup exhaust or ignite can help compensate for the ghost, although I still think going TP is better. Leashing is not good in this matchup as he can stack up rage and get lucky crits on you.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png", "images/summs/Ghost.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Udyr": {
    "champion_icon": "images/champs/Udyr.png",
    "difficulty": "Very Hard",
    "tips": "Runes: PTA Goal in lane: Depending on how he plays, you can look for kills if he plays aggressive, if passive, look to get more resources than him. Wave 1-4: Look for poke, but don't fight too much, as you win level 3 really hard. Tips: Very bad matchup Udyr is too strong in the moment His Phoenix form makes it so easy for him to kite vitals Turtle form helps him tank so much damage and sustain So you can never really beat him early game, he bullies you super hard, denies u access to vitals and much more. You wanna try to play as aggressive as possible early to not let him bully you too hard Once you get Hydra the matchup is easier, boots of swiftness aren't bad in this matchup!",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ghost.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/mrboots.png", "images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Urgot": {
    "champion_icon": "images/champs/Urgot.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Get a freeze, and try to punish him as much as possible, deny him resources. Wave 1-4: Poke on front vitals, be careful of his E, you usually can't get priority in this matchup. Tips: In this matchup you want to go D Shield + Second wind for his poke, look to poke him down on front vitals (preferrably where he doesnt have an empowered auto due to passive). Avoid getting hit by Q by using your Q, as otherwise his W will focus and prioritize you. Going for back vitals is very dangerous as he can run you down sort of and he will have empowered autos. In this MU you really want to wither him down and then look for an all in, you can flash in front of his E and parry it if needed. His R1 is easier to react to so parrying that could be the most viable option, his R2 (when the chains come towards you to pull you in) is way harder to react to due to the sheer speed of the spell, but if you succeed he gets stunned, so high risk and high reward!",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png","images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Vayne": {
    "champion_icon": "images/champs/Vayne.png",
    "difficulty": "Very Hard",
    "tips": "Runes: PTA Goal in lane: Survive, have more resources, call for jungle ganks to punish her, very tough lane now that they go fleet Vayne top. Wave 1-4: Just play for poke, wait your level 3 and look for trades with parry, if you hit parry you win, if u dont, you lose, as simple as that. Tips: Similar to Lucian, parry her W pop, look to poke with front vitals, if you can react to her E and parry it on to her she gets hard punished for it, otherwise try to parry her auto's but wait for her to Q or else she can dodge it too easily. You need to play for Bushes or else you get completely poked down. Care when she has berserk boots as she can run you down and 100-0 you. Tabis are also HUGE in this matchup. When you are level 6 you want to becareful as she can kite you really hard, so wait to hit a QW to use R. Otherwise she is very vulnerable to ganks, you can even kill her pre6 if she isn't careful with a solid engage and if u parry her E just once.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png","images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Viego": {
    "champion_icon": "images/champs/Viego.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Stomp him in lane, deny resources. Wave 1-4: Cheater > Freeze. Tips: D Shield + Second wind is amazing versus his poke. His Q spam is really annoying due to the damage and conqueor stacking, try to dodge as much Q's as possible, but with correct items and runes you will heal up the poke back. Parry his double auto or his W if you can, very reactable, same for his ultimate. If you can stay disciplined you win hard after 1st or 2nd recall, but really hard after Hydra. Care for bramble vest as he becomes really tanky. Level 6 look for short trades with parry and he loses them, especially due to his sustain being nerfed on minions. This matchup is a bit rough, but with properly discipline and good parries you win it!",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png","images/items/armorboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Viktor": {
    "champion_icon": "images/champs/Viktor.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Get more resources than him, get plates, get a gold lead, you win on Trinity. Wave 1-4: Don't contest the wave too hard, try to match his push, get some poke in when possible, but you can beat him up on level 2-3 Tips: Matchup similar to many ranged toplaners. Go for sustain runes and starter. Poke him on front vitals and typically look to parry his Q, you can poke him down with small trades (Q AA E E2 W). Leading to a dive with your jungler or just a solo kill if he isn't careful when your parry comes back up again. He can't hard outrade you if you play it intelligently. Again boots early are really helpful. Pull in waves for all ins, use bushes to avoid poke and try to setup ganks with QW. Hydra rush is awesome here.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dshield.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png","images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Vladimir": {
    "champion_icon": "images/champs/Vladimir.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Try to get some solo kills by poking him down, and getting a freeze, forcing him to choose either to recall, or lose resources. Wave 1-4: Go for small poke, either Q with grasp, or Q + PTA procs for the early damage, do not contest prio too hard. Tips: Take ignite. This matchup can go both ways, early Fiora wins, then Vlad wins once he gets early cdr and movespeed as he is not easy to rundown with low cdr on Fiora. Although, once you get 2+ items you 1v1 him pretty comfortably as long as he isnt overfed due to having high AD and him being an hp oriented champion, you simply run him down on the sidelane. You can go PTA/Conq + Celerity/Nimbus Cloak followed with ignite due to his healing. Very cheesy but works really well vs Vlad. Try to parry his empowered Q or his ultimate explosion, his ulti is easier to parry though. Similar to most matchups you want the wave to be pulled in to run him down, he likes to be under turret and perma healing and poking with Q while running.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png","images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/maw.png"],
    "other_items": ["images/items/dd.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Volibear": {
    "champion_icon": "images/champs/Volibear.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Parry his W2 and you win 100% of the times, especially with ignite in this matchup Wave 1-4: Get prio if possible, try to cheater recall, if you cannot, wait until level 3 to fight him, as you win 100%, do not extend trades too long. Tips: In this matchup, you want to poke down Voli to then look for an all in, he lacks a lot of range, so front vitals are free damage, and he can't chase u due to the movespeed. You want to look to parry his Q (Even better, they often Q into E), or his EMPOWERED W, his 1st W doesn't do much damage but puts a mark on you, that disappears after a few seconds and then the 2nd W if you are marked will deal HIGH DAMAGE. Though if you parry the 2nd one, the whole spell resets, and he becomes very vulnerable, you can usually trick them into using it if you go in when the W mark is going to disappear as they want to make use of it. Care for turret dives when he reaches level 6 as if the enemy jungle comes it's hard to survive the 1v2 without turret dealing damage. As long as you kite him out and poke him down you win.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Warwick": {
    "champion_icon": "images/champs/Warwick.png",
    "difficulty": "Hard",
    "tips": "Runes: PTA Goal in lane: Win this lane, dominate it, Fiora should win this matchup if played properly. Wave 1-4: Poke him down with Q's outside of his Q range, especially when he tries to last hit you. Tips: Take dblade in this matchup, you want to look to poke him down with front vitals Q's, to then look for an all in, try to look for Q's when he is cs'ing, so he can't walk up and Q you back. Trade him until he is 50% hp, and then you need to ALL in with ignite, as he only heals off auto attacks if he is below 50% health, so trading anymore then that, without the intention of killing him, is usually bad. You want to parry his E if possible, if not his Q is also very nice to parry as it's his main source of damage and healing. He can win early if you are impatient but as long as you wait until 6 (executioners or ignite is also good to have before but not necessary) then you will win this matchup. Don't underestimate them especially if they have barrier, when they are low hp they can steal dish out a lot of DMG especially if you are in W HP range. Parry his ultimate for a free win if you have the mind game down, otherwise tanking it is fine, it is reactable from far though. So tether and kite vitals, look for an all in, and you win it, if they have barrier, and you have TP abuse the advantage you have, you can just recall and TP for better items, every bit of extra damage is really helpful in this matchup, so go coup de grace.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png", "images/items/mrboots.png", "images/items/swifties.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png", "images/items/maw.png"],
    "other_items": ["images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Wukong": {
    "champion_icon": "images/champs/Wukong.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Beat him up, get a freeze and punish him, early lead is very important here, so ask your jungler for a gank. Wave 1-4: Play for poke, don't trade too much, if u do, do it near your minions so you can out damage him, you don't get prio early, so wait till you get level 3 to start contesting waves and whatnot. Tips: Ah the monke king himself. There are 2 ways you can play this matchup, either you take DShield + Second Wind and wait for your mythic + tabis and just scale and play for short trades. Otherwise, what I prefer is taking Dblade with Boneplating and looking to all in him. You can parry his E while he is flying towards you, but the best thing to parry pre6 is the double Q with his clone, hard to parry but if u manage to it's amazing. I typically like to hold my parry as using it towards the end for his next Q or E for the AS nerf as going for a greedy parry isn't that worth it as if you fail it you are doomed. Level 6 if you don't have a lead, he will run you down, typically with sheen + bramble or executioners, so play very safe! If you can parry his ultimate (typically used after Q for armor shred), then you can hard win it, otherwise you will struggle, so I suggest scaling and waiting until you get goredrinker! With 2+ items you outscale him on side as long as he doesn't have a huge lead.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png", "images/summs/Ignite.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Yasuo": {
    "champion_icon": "images/champs/Yasuo.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Bully him on level 3 and onwards. Wave 1-4: Play passive, look for Q poke, its usually hard to get prio in this matchup before level 3. Tips: Very similar to the yone matchup, look for poke, proc his shield and then look for an all in while dodging his Q's you don't want to be too pushed in, as he can get short trades and u cant run him down. Look to parry his Q with a QW through the windwall if possible as they will often block your Q. Care not to carelessly spam your Q as he can use the dash to dodge your Q and make you miss vitals. Use the movespeed from vitals and ultimate to dodge his Q's. Hold your Q to follow him when dashing as if you Q too early he can just kite you out too easily. You win with short trades, Q AA E1 E2. Pull in waves and look to all in him, tabis are a really good buy here.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Yone": {
    "champion_icon": "images/champs/Yone.png",
    "difficulty": "Even",
    "tips": "Runes: PTA Goal in lane: Bully him on level 3 and onwards. Wave 1-4: Play passive, look for Q poke, its usually hard to get prio in this matchup before level 3. Tips: This matchup really depends on the skill of the Yone player (i've played vs dzukill, its rough). It can go from being really easy, to a struggle in lane. Essentially what you want to do is poke him down with Q's look for short trades, he is also very gankable so calling for ganks can help as well, he struggles in the long lane as he is very easy to rundown. Look to dodge his Q's while trading with the movespeed, if you can parry his Q or R, often times you need to parry behind you if he is too close or if you parry ultimate. Care as some players will dodge after using Q or use E to dodge your parry. Don't push as it benefits him too much, care when he has berserk boots as the lane because 10x harder. Tabis are a huge buy here after your Hydra.",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  },
  "Yorick": {
    "champion_icon": "images/champs/Yorick.png",
    "difficulty": "Easy",
    "tips": "Runes: PTA Goal in lane: Punish him as much as possible before he gets level 6, as it is much harder when he has maiden. Wave 1-4: Cheater > Freeze. Tips: Trade him a lot early game, you completely destroy him in the early trades, try to parry his Q or E in early trades (parry E if he has ghouls that can attack you as the dmg is really high). After level 6 he can perma push and sort of outrade you due to the damage he gets, but you can farm it up poke him down while dodging E, and then look for an all in, especially if you have a nice pickaxe and some longswords, once you get Hydra you can kill him in the all in. One trick you can do his parry his cage as it displaces you when you are on the wall, so you can then parry that onto him and get a sick combo off. Care for when he get bramble vest and sheen as he can be a bit of a problem with those items!",
    "runes": "images/runes/page1.png",
    "summoner_spells": ["images/summs/Teleport.png", "images/summs/Flash.png"],
    "starter_items": ["images/items/dblade.png", "images/items/pot.png"],
    "boots": ["images/items/boots.png", "images/items/armorboots.png"],
    "core_items": ["images/items/hydra.png", "images/items/eclipse.png", "images/items/dd.png"],
    "other_items": ["images/items/maw.png", "images/items/shojin.png", "images/items/hullbreaker.png", "images/items/triforce.png", "images/items/steraks.png", "images/items/ga.png"],
    "ability_max_order": "Q > 2-3 points E > W > R"
  }
}